In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame(np.random.rand(4, 3)*100, 
                    columns=['Physics','Çhemistry','Maths'],
                    index = ['Student 1', 'Student 2','Student 3','Student 4'])

In [3]:
data

             Physics  Çhemistry      Maths
Student 1  11.849391  28.713003  79.864810
Student 2  16.650692  84.210567  92.854690
Student 3  72.804809  40.681747  35.292184
Student 4  37.716594  56.268743  52.028996

In [4]:
RoundUpto2Decimal = lambda x: round(x,2)

In [5]:
data.applymap(RoundUpto2Decimal)

           Physics  Çhemistry  Maths
Student 1    11.85      28.71  79.86
Student 2    16.65      84.21  92.85
Student 3    72.80      40.68  35.29
Student 4    37.72      56.27  52.03

In [6]:
AverageMarks = lambda x: np.mean(x)

In [7]:
data.apply(AverageMarks)

Physics      34.755372
Çhemistry    52.468515
Maths        65.010170
dtype: float64

In [8]:
data.apply(AverageMarks,axis = 1)

Student 1    40.142401
Student 2    64.571983
Student 3    49.592914
Student 4    48.671444
dtype: float64

In [9]:
SquareOfMarks = lambda x: x**2

In [10]:
data['Physics'].map(SquareOfMarks)

Student 1     140.408063
Student 2     277.245559
Student 3    5300.540214
Student 4    1422.541461
Name: Physics, dtype: float64

In [11]:
data.apply(lambda x: (x-np.min(x))/(np.max(x)-np.min(x)))

            Physics  Çhemistry     Maths
Student 1  0.000000   0.000000  0.774334
Student 2  0.078767   1.000000  1.000000
Student 3  1.000000   0.215663  0.000000
Student 4  0.424363   0.496522  0.290759